Dlubal.RFEM5.MaterialModelType
Type of the material model

Dlubal.RFEM5.MaterialModelType.UnknownMaterialModelType
Unknown type of the material model

Dlubal.RFEM5.MaterialModelType.IsotropicLinearElasticType
Isotropic linear elastic

Dlubal.RFEM5.MaterialModelType.IsotropicNonlinearElastic1DType
Isotropic nonlinear elastic 1D

Dlubal.RFEM5.MaterialModelType.IsotropicNonlinearElastic2D3DType
Isotropic nonlinear elastic 2D/3D

Dlubal.RFEM5.MaterialModelType.IsotropicPlastic1DType
Isotropic plastic 1D

Dlubal.RFEM5.MaterialModelType.IsotropicPlastic2D3DType
Isotropic plastic 2D/3D

Dlubal.RFEM5.MaterialModelType.OrthotropicElastic2DType
Orthotropic elastic 2D

Dlubal.RFEM5.MaterialModelType.OrthotropicElastic3DType
Orthotropic elastic 3D

Dlubal.RFEM5.MaterialModelType.OrthotropicPlastic2DType
Orthotropic plastic 2D

Dlubal.RFEM5.MaterialModelType.OrthotropicPlastic3DType
Orthotropic plastic 3D

Dlubal.RFEM5.MaterialModelType.TransverselyIsotropicElastic3DType
Transversely isotropic elastic 3D

Dlubal.RFEM5.MaterialModelType.IsotropicThermalElasticType
Isotropic thermal-elastic

Dlubal.RFEM5.MaterialModelType.IsotropicMasonry2D
Isotropic masonry 2D